This is notebook is about sql operation on the data. It includes query execution and information extraxtion from our database.
The database is IMDB movie database

In [ ]:
import pandas as pd
import sqlite3 as sql
from sqlite3 import Error
def sqlite_connection(database_dir):
    #this function establishes connection to our database 
    connection=None
    try:
        connection=sql.connect(database_dir)
        print("DATABASE IS SUCCESSFULLY CONNECTED")
    except Error as err:
        #print error message if the connection goes wrong
        print(f"ERROR:'{err}'")
        print("DATABASE CONNECTION IS NOT SUCCESSFUL")
    return connection
#connecting to the imdb database
connection=sqlite_connection('Db-IMDB.db')

DATABASE IS SUCCESSFULLY CONNECTED

In [ ]:
#what kind of tables we have in our database
query="SELECT * FROM sqlite_master where type='table';"
re=pd.read_sql_query(query,connection)
re.head(5)

,type,name,tbl_name,rootpage,sql
0,table,Movie,Movie,2,"CREATE TABLE ""Movie"" (\n""index"" INTEGER,\n ""M..."
1,table,Genre,Genre,4,"CREATE TABLE ""Genre"" (\n""index"" INTEGER,\n ""N..."
2,table,Language,Language,5,"CREATE TABLE ""Language"" (\n""index"" INTEGER,\n ..."
3,table,Country,Country,6,"CREATE TABLE ""Country"" (\n""index"" INTEGER,\n ..."
4,table,Location,Location,7,"CREATE TABLE ""Location"" (\n""index"" INTEGER,\n ..."

In [ ]:
query='SELECT * FROM Country'
d_1=pd.read_sql_query(query,connection)
print("Country of shooting")
d_1.head(5)

Country of shooting

,index,Name,CID
0,0,UK,0
1,1,USA,1
2,2,India,2
3,3,Australia,3
4,4,Hong Kong,4

In [ ]:
query='SELECT * FROM Movie'
d_2=pd.read_sql_query(query,connection)
print("The title of the movies")
m.head(5)

The title of the movies

,index,Name,LID
0,0,"Durban, South Africa",0
1,1,"New York City, New York, USA",1
2,2,"Cape Town Film Studios, Cape Town, Western Cap...",2
3,3,"Pittsburgh, Pennsylvania, USA",3
4,4,"Atlanta, Georgia, USA",4

In [ ]:
query='SELECT * FROM Location'
m=pd.read_sql_query(query,connection)
print("The location of shooting")
m.head(5)

The location of shooting

,index,Name,LID
0,0,"Durban, South Africa",0
1,1,"New York City, New York, USA",1
2,2,"Cape Town Film Studios, Cape Town, Western Cap...",2
3,3,"Pittsburgh, Pennsylvania, USA",3
4,4,"Atlanta, Georgia, USA",4

In [ ]:
list_1=['Name','GID']
query='SELECT Name,GID FROM Genre'
n=pd.read_sql_query(query,connection)
print(n.shape)
n.head(3)

(328, 2)

,Name,GID
0,"Adventure, Drama, Fantasy",0
1,"Action, Comedy, Crime",1
2,"Action, Adventure, Fantasy",2

In [ ]:
query='SELECT Name FROM Genre'
data=pd.read_sql_query(query,connection)
data.head()

,Name
0,"Adventure, Drama, Fantasy"
1,"Action, Comedy, Crime"
2,"Action, Adventure, Fantasy"
3,"Action, Adventure, Sci-Fi"
4,"Drama, Horror, Thriller"

In [ ]:
query='SElECT COUNT(DISTINCT Name) FROM Genre'
d=pd.read_sql_query(query,connection)

print(d)

   COUNT(DISTINCT Name)
0                   328

In [ ]:
query="""
SELECT Count(*) FROM (SELECT DISTINCT Country FROM Genre)"""
data=pd.read_sql(query,connection)
print(data.shape)
data.head(4)

DatabaseError: DatabaseError: Execution failed on sql '
SELECT Count(*) FROM (SELECT DISTINCT Country FROM Genre)': no such column: Country

In [ ]:
from lets_plot.bistro import corr
corr.corr_plot(data.head(4)).points().build()

In [ ]:
query='SELECT * FROM Genre WHERE Name="Action,Comedy,Crime"'
df=pd.read_sql_query(query,connection)
df.shape

(0, 3)

In [ ]:
query='SELECT * FROM Country WHERE Name LIKE "%K"'
data_f=pd.read_sql_query(query,connection)
data_f.head(4)

,index,Name,CID
0,0,UK,0
1,7,Denmark,7

In [ ]:
query='SELECT * FROM Country WHERE Name LIKE  "U%" AND (CID=0 OR CID=7)'
data=pd.read_sql_query(query,connection)
data.shape
data.head(4)

,index,Name,CID
0,0,UK,0

In [ ]:
#ORDERBY
query='SELECT * FROM Country ORDER BY CID'
data=pd.read_sql_query(query,connection)
data.head(2)

,index,Name,CID
0,0,UK,0
1,1,USA,1

In [ ]:
query='SELECT * FROM Country ORDER BY CID DESC'
data=pd.read_sql_query(query,connection)
data.head(2)

,index,Name,CID
0,33,Georgia,33
1,32,New Zealand,32

In [ ]:
#IS NULL 
query='SELECT Name,CID FROM Country WHERE Name IS NOT NULL'
data=pd.read_sql_query(query,connection)
data.head(10)

,Name,CID
0,UK,0
1,USA,1
2,India,2
3,Australia,3
4,Hong Kong,4
5,Germany,5
6,Canada,6
7,Denmark,7
8,Belgium,8
9,South Korea,9

In [ ]:
#count The number of names in name columns with ac together
query='SELECT COUNT(Name) FROM Genre WHERE Name LIKE "%ac%"'
data=pd.read_sql_query(query,connection)
data.head(3)

,COUNT(Name)
0,90

In [ ]:
query='SELECT * FROM Country AS countries WHERE Name IN ("UK","USA","India")'
data=pd.read_sql(query,connection)
data.head(7)

,index,Name,CID
0,0,UK,0
1,1,USA,1
2,2,India,2

In [ ]:
query='SELECT Country.Name,Genre.Name FROM Country LEFT JOIN Genre ON Genre.Name=Country.Name'
data=pd.read_sql(query,connection)
data.head(5)

,Name,Name
0,UK,None
1,USA,None
2,India,None
3,Australia,None
4,Hong Kong,None

In [ ]:
query='SELECT Country.Name,Genre.Name FROM Country LEFT JOIN Genre ON Country.Name=Genre.Name'
d=pd.read_sql_query(query,connection)
d.head(4)

,Name,Name
0,UK,None
1,USA,None
2,India,None
3,Australia,None

In [ ]:
query='SELECT Name FROM Country UNION ALL SELECT Name FROM Language'
data=pd.read_sql_query(query,connection)
data.head(4)

,Name
0,UK
1,USA
2,India
3,Australia

In [ ]:
query='SELECT Name,CID FROM Country WHERE Name IS NOT NULL GROUP BY CID'
data=pd.read_sql_query(query,connection)
data.head(10)

,Name,CID
0,UK,0
1,USA,1
2,India,2
3,Australia,3
4,Hong Kong,4
5,Germany,5
6,Canada,6
7,Denmark,7
8,Belgium,8
9,South Korea,9

In [ ]:
print("hello there this is minte")

hello there this is minte